{
  "DESCRIPTION": "Edit the modules of the bot.",
  "EXAMPLE1": "`{cmd_name}`",

  "moduleEmbed": {
    "TITLE": "{echo} modules in {guild}",
    "DESCRIPTION": "**Here is a mini tutorial on how to use this command.**\n> *{on}/{off} To toggle a module, you need to specify a module× as the first argument and on or off as the second argument*.\n\n> *To edit a module like the auto-role, you should make the first argument as a module name, the second as edit `edit` and the third as the new value (a role of the auto-role).*\n\n**×Here is the list of available module :**\n> **Anti-Alt :** *A simple module that kicks member if their account is not old enought.*\n> **Auto-Role :** *Add a role to new member joining your server.*\n> **Level :** *A level module.*",
    "BUTTONS": "**When you click on one of those buttons, it will show you a more detailed description about the module on the button.**"
  },
  "firstArg": {
    "ERR": "Please specify a valid module ! ({modules})"
  },

  "level": {
    "NOS": "Please specify `on` or `off` as the second argument to toggle on/off the module.",
    "ALENABLED": "The level module is already enabled on this server !",
    "ALDISABLED": "The level module is already disabled on this server !",

    "ENABLED": "The level module has been successfully enabled on this server !",
    "DISABLED": "The level module has been successfully disabled on this server !",

    "INVALIDARGS": "Please specify the second argument as a `on` or `off` !"
  },

  "autorole": {
    "NOS": "Please specify `on` or `off` as the second argument to toggle on/off the module or `edit` to change the role for the autorole.",

    "ALENABLED": "Auto-role is already enabled on this server !",
    "ALDISABLED": "Auto-role is already disabled on this server !",

    "ENABLED": "Auto-role has been successfully enabled on this server !\n\n Don't forget to add the role by typing as the second argument `edit` and the third a role !",
    "DISABLED": "Auto-role has been successfully disabled on this server !\n\n The role used for the auto-role has been reseted !",

    "INVALIDARGS": "Please specify the first argument as a `on` or `off` to toggle the module or you can specify `edit` to edit the role used for the autorole !",
    "ROLE": "MENTION or tell the ID of the role that you want to set for the autorole !",

    "ALROLE": "Please enable the autorole module before editing it's role ! ({name})",
    "ROLEROLE": "Please don't specify the same role that you were using before !",
    "EDITED": "The role used for the auto-role is now {role} !"
  },

  "antialt": {
    "NOS": "Please specify `on` or `off` as the second argument to toggle on/off the module or `edit` to change the time (in days) for the anti-alt.",

    "ALENABLED": "Anti-alt is already enabled on this server !",
    "ALDISABLED": "Anti-alt is already disabled on this server !",

    "ENABLED": "Anti-alt has been successfully enabled on this server !\n\n Don't forget to add the time for the anti-alt to work by typing as the second argument `edit` and the third a number (it will be in days) !",
    "DISABLED": "Anti-alt has been successfully disabled on this server !\n\n The time used has been reseted !",

    "INVALIDARGS": "Please specify the first argument as a `on` or `off` to toggle the module or you can specify `edit` to edit the time (in days) of the anti-alt !",
    "ROLE": "Please specify a third argument !",
    "NOTTIME": "The third argument must be a number !",

    "ALROLE": "Please enable the anti-alt module before editing it's time ! ({name})",
    "ROLEROLE": "Please don't specify the same time that you were using before !",
    "EDITED": "Now, to join the server, the user's account must be atleast {day} days old !"
  },

  "helpembed": {
    "antialt": {
      "TITLE": "🤖 Help on the anti-alt module.",
      "MODULEDESCRIPTION": "**Anti-alt is a module that kicks member if their account is not as aged as you want. eg: the anti-alt is set to 14 days so all users that have an account that is not atleast 14 days old will be kicked from the server when they join.**",
      "EXAMPLES": "**Here is how to toggle or edit the anti-alt :**\n> *Toggle on :* `{prefix}module` `anti-alt` `on`\n> *Toggle off :* `{prefix1}module` `anti-alt` `off`\n\n> *Edit the time amount of days that the account must be atleast old :* `{prefix2}module` `anti-alt` `edit` `10`"
    },
    "autorole": {
      "TITLE": "🎭 Help on the auto-role module.",
      "MODULEDESCRIPTION": "**Auto-role is a module that adds a role to all new members on the server. eg: auto-role is set to @Member so new members will get the role @Member.**",
      "EXAMPLES": "**Here is how to toggle or edit the auto-role :**\n> *Toggle on :* `{prefix}module` `auto-role` `on`\n> *Toggle off :* `{prefix1}module` `auto-role` `off`\n\n> *Edit the role :* `{prefix2}module` `auto-role` `edit` `@Role`"
    },
    "level": {
      "TITLE": "📊 Help on the level module.",
      "MODULEDESCRIPTION": "**The level module is a level module (lol) you can only toggle it off or on.**",
      "EXAMPLES": "**Here is how to toggle the level module :**\n> *Toggle on :* `{prefix}module` `level` `on`\n> *Toggle off :* `{prefix1}module` `level` `off`"
    }
  }
}
